# NoxPHP

#### 介绍
NoxPHP是一个基于ThinkPHP5.1.34LTS开发的一套开源PHP快速开发框架，NoxPHP秉承极简、极速、极致的开发理念，为开发集成了基于数据-角色的权限管理机制，集成多种灵活快速构建工具，可方便快速扩展的模块、插件、钩子、数据包。统一了模块、插件、钩子、数据包之间的版本和依赖关系，进一步降低了代码和数据的冗余，以方便开发者快速构建自己的应用。
#### 软件架构

- 规范 ： OneBase 提供一套编码规范，可使团队研发协作事半功倍。
- 严谨 ： 异常严谨的错误检测和安全机制，详细的日志信息，为您的研发保驾护航。
- 灵活 ： 分层，服务，插件等合理的解耦合设计使您升级框架或需求变更得心应手。
- 接口 ： 完善的接口架构，只需关注业务逻辑研发，省心省力。
- 高效 ： 清晰的系统执行流程，不浪费一丝效率。
- 特色 ： 权限继承，资源回收，前缀对象定位，各种设计思想。
- 精简 ： 精简到极致的控制器，强迫症患者的良药。
- 体验 ： 后台PJAX模式可自由切换，速度快到无法呼吸。
- 进阶 ： 索引，分表分库，Redis，分布式，集群，负载均衡。


#### 环境要求

- Nginx/Apache/IIS
- PHP5.4+
- MySQL5.1+1


#### 安装教程

1.把系统所需要文件上传到你的网站根目录，addons,data,uploads,runtime,config权限为777。访问http:域名/index.php/install/即可进入安装。PHP5.6或以上，但是为了最佳运行效果我们建议你使用PHP7.0或以上的版本，MYSQL建议在5.5或以上注意字符是utf8mb4

#### 使用说明

1. 本项目正在努力完善，希望大家多多支持

#### 参与贡献

1. Fork 本仓库
2. 新建 Feat_xxx 分支
3. 提交代码
4. 新建 Pull Request
